In [2]:
# import pandas, numpy
import numpy as np
import pandas as pd

# Create the required data frames by reading in the files
df=pd.read_excel('SaleData.xlsx')

In [60]:
df.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95,1198.0,113810.0
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50,500.0,25000.0
2,2018-02-09,Central,Hermann,Luis,Television,36,1198.0,43128.0
3,2018-02-26,Central,Timothy,David,Cell Phone,27,225.0,6075.0
4,2018-03-15,West,Timothy,Stephen,Television,56,1198.0,67088.0

In [61]:
df['yr'] = df.OrderDate.apply(lambda x: x.strftime('%Y'))

In [62]:
df.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt,yr
0,2018-01-06,East,Martha,Alexander,Television,95,1198.0,113810.0,2018
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50,500.0,25000.0,2018
2,2018-02-09,Central,Hermann,Luis,Television,36,1198.0,43128.0,2018
3,2018-02-26,Central,Timothy,David,Cell Phone,27,225.0,6075.0,2018
4,2018-03-15,West,Timothy,Stephen,Television,56,1198.0,67088.0,2018

In [63]:
df.groupby(['yr','Region'])

In [64]:
df.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt,yr
0,2018-01-06,East,Martha,Alexander,Television,95,1198.0,113810.0,2018
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50,500.0,25000.0,2018
2,2018-02-09,Central,Hermann,Luis,Television,36,1198.0,43128.0,2018
3,2018-02-26,Central,Timothy,David,Cell Phone,27,225.0,6075.0,2018
4,2018-03-15,West,Timothy,Stephen,Television,56,1198.0,67088.0,2018

In [65]:
ls = df.groupby(["Item"])

In [66]:
ls

In [67]:
ls = df.groupby(["Item"])["Sale_amt"]

In [68]:
ls

In [69]:
ls = df.groupby(["Item"])["Sale_amt"].min()

In [70]:
ls.head()

Item
Cell Phone      3375.0
Desk             250.0
Home Theater    2000.0
Television      8386.0
Video Games      936.0
Name: Sale_amt, dtype: float64

In [71]:
df.groupby(['yr','Region'])["Sale_amt"].sum().reset_index()

     yr   Region  Sale_amt
0  2018  Central  479825.0
1  2018     East  293780.0
2  2018     West  105424.0
3  2019  Central  349944.5
4  2019     East   27227.0
5  2019     West   49475.0

In [72]:
df.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt,yr
0,2018-01-06,East,Martha,Alexander,Television,95,1198.0,113810.0,2018
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50,500.0,25000.0,2018
2,2018-02-09,Central,Hermann,Luis,Television,36,1198.0,43128.0,2018
3,2018-02-26,Central,Timothy,David,Cell Phone,27,225.0,6075.0,2018
4,2018-03-15,West,Timothy,Stephen,Television,56,1198.0,67088.0,2018

In [74]:
curr_time = pd.to_datetime("now")
curr_time

Timestamp('2019-12-20 06:21:49.468855')

In [75]:
df['days_diff'] = curr_time - df['OrderDate']

In [76]:
df.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt,yr,days_diff
0,2018-01-06,East,Martha,Alexander,Television,95,1198.0,113810.0,2018,713 days 06:21:49.468855
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50,500.0,25000.0,2018,696 days 06:21:49.468855
2,2018-02-09,Central,Hermann,Luis,Television,36,1198.0,43128.0,2018,679 days 06:21:49.468855
3,2018-02-26,Central,Timothy,David,Cell Phone,27,225.0,6075.0,2018,662 days 06:21:49.468855
4,2018-03-15,West,Timothy,Stephen,Television,56,1198.0,67088.0,2018,645 days 06:21:49.468855

In [80]:
def day_left(x):
    t=str(x)
    return t[0:7]

In [81]:
df['days_diff_1']=df['days_diff'].apply(day_left)

In [82]:
df.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt,yr,days_diff,days_diff_1
0,2018-01-06,East,Martha,Alexander,Television,95,1198.0,113810.0,2018,713 days 06:21:49.468855,713 day
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50,500.0,25000.0,2018,696 days 06:21:49.468855,696 day
2,2018-02-09,Central,Hermann,Luis,Television,36,1198.0,43128.0,2018,679 days 06:21:49.468855,679 day
3,2018-02-26,Central,Timothy,David,Cell Phone,27,225.0,6075.0,2018,662 days 06:21:49.468855,662 day
4,2018-03-15,West,Timothy,Stephen,Television,56,1198.0,67088.0,2018,645 days 06:21:49.468855,645 day

In [96]:
ls=df['days_diff_1'].reset_index()
t=df['days_diff_1']

In [100]:
print(type(t))
print(type(ls))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [101]:
df.columns

Index(['OrderDate', 'Region', 'Manager', 'SalesMan', 'Item', 'Units',
       'Unit_price', 'Sale_amt', 'yr', 'days_diff', 'days_diff_1'],
      dtype='object')

In [135]:
x=df.groupby(['Manager'])['SalesMan'].unique().reset_index()

In [123]:
c=df.groupby(['Manager','SalesMan']).max()

In [136]:
type(x)

pandas.core.frame.DataFrame

In [128]:
c.columns

Index(['OrderDate', 'Region', 'Item', 'Units', 'Unit_price', 'Sale_amt', 'yr',
       'days_diff', 'days_diff_1'],
      dtype='object')

In [131]:
c.reset_index()

,Manager,SalesMan,OrderDate,Region,Item,Units,Unit_price,Sale_amt,yr,days_diff,days_diff_1
0,Douglas,John,2019-02-01,Central,Television,87,1198.0,80266.0,2019,475 days 06:21:49.468855,475 day
1,Douglas,Karen,2018-12-29,East,Video Games,81,500.0,40500.0,2018,509 days 06:21:49.468855,509 day
2,Douglas,Michael,2019-10-14,West,Television,57,1198.0,38336.0,2019,577 days 06:21:49.468855,67 days
3,Hermann,Luis,2019-12-04,Central,Video Games,94,1198.0,107820.0,2019,679 days 06:21:49.468855,679 day
4,Hermann,Shelli,2019-08-07,Central,Video Games,96,500.0,25000.0,2019,696 days 06:21:49.468855,696 day
5,Hermann,Sigal,2019-07-21,Central,Video Games,90,1198.0,107820.0,2019,543 days 06:21:49.468855,543 day
6,Martha,Alexander,2019-07-04,East,Video Games,95,1198.0,113810.0,2019,713 days 06:21:49.468855,713 day
7,Martha,Diana,2019-04-27,East,Home Theater,96,500.0,21600.0,2019,526 days 06:21:49.468855,526 day
8,Martha,Steven,2019-12-21,Central,Television,75,1198.0,89850.0,2019,611 days 06:21:49.468855,611 day
9,Timothy,David,2019-09-10,Central,Television,80,1198.0,63494.0,2019,662 days 06:21:49.468855,662 day
10,Timothy,Stephen,2019-09-27,West,Television,76,1198.0,67088.0,2019,645 days 06:21:49.468855,84 days

In [132]:
c.columns

Index(['OrderDate', 'Region', 'Item', 'Units', 'Unit_price', 'Sale_amt', 'yr',
       'days_diff', 'days_diff_1'],
      dtype='object')

In [137]:
x

   Manager                    SalesMan
0  Douglas      [Michael, Karen, John]
1  Hermann       [Shelli, Luis, Sigal]
2   Martha  [Alexander, Steven, Diana]
3  Timothy            [David, Stephen]

In [138]:
x.columns

Index(['Manager', 'SalesMan'], dtype='object')

In [146]:
df.groupby('Region')['SalesMan'].unique()

Region
Central    [Shelli, Luis, David, Steven, Sigal, John]
East                        [Alexander, Diana, Karen]
West                               [Stephen, Michael]
Name: SalesMan, dtype: object

In [211]:
o=df.groupby(['Region','SalesMan']).sum()

In [195]:
y=df.groupby(['Region','SalesMan']).sum().reset_index()

In [216]:
o=o.reset_index()

In [217]:
o

     Region   SalesMan  Units  Unit_price  Sale_amt
0   Central      David    213      3621.0  140955.0
1   Central       John    156      1823.0  124016.0
2   Central       Luis    281      3454.5  206373.0
3   Central     Shelli    193       742.0   33698.0
4   Central      Sigal    173      1756.5  125037.5
5   Central     Steven    183      4094.0  199690.0
6      East  Alexander    396      4238.0  236703.0
7      East      Diana    125       725.0   36100.0
8      East      Karen    170       783.5   48204.0
9      West    Michael     89      1698.0   66836.0
10     West    Stephen    142      2048.0   88063.0

In [167]:
x=df.groupby(['Region'])['SalesMan'].unique().reset_index()

In [196]:
y

     Region   SalesMan  Units  Unit_price  Sale_amt
0   Central      David    213      3621.0  140955.0
1   Central       John    156      1823.0  124016.0
2   Central       Luis    281      3454.5  206373.0
3   Central     Shelli    193       742.0   33698.0
4   Central      Sigal    173      1756.5  125037.5
5   Central     Steven    183      4094.0  199690.0
6      East  Alexander    396      4238.0  236703.0
7      East      Diana    125       725.0   36100.0
8      East      Karen    170       783.5   48204.0
9      West    Michael     89      1698.0   66836.0
10     West    Stephen    142      2048.0   88063.0

In [168]:
x

    Region                                    SalesMan
0  Central  [Shelli, Luis, David, Steven, Sigal, John]
1     East                   [Alexander, Diana, Karen]
2     West                          [Stephen, Michael]

In [208]:
region=[]
salesmen_count=[]
for i,j in enumerate(x['SalesMan']):
    region.append(x['Region'][i])
    salesmen_count.append(len(j))

In [209]:
region

['Central', 'East', 'West']

In [210]:
salesmen_count

[6, 3, 2]

In [225]:
s=df.groupby('Region')['Units'].sum().reset_index()

In [226]:
r=df.groupby('Region')['SalesMan'].nunique().reset_index()

In [227]:
r

    Region  SalesMan
0  Central         6
1     East         3
2     West         2

In [228]:
s

    Region  Units
0  Central   1199
1     East    691
2     West    231

In [236]:
new_df=pd.merge(r,s,how='inner',on='Region')

In [237]:
new_df

    Region  SalesMan  Units
0  Central         6   1199
1     East         3    691
2     West         2    231

In [238]:
type(new_df)

pandas.core.frame.DataFrame

In [249]:
new_df.rename(columns={'SalesMan':'salesmen_count','Units' : 'total_sales'}, inplace=True)

In [250]:
new_df.columns

Index(['Region', 'salesmen_count', 'total_sales'], dtype='object')

In [251]:
new_df

    Region  salesmen_count  total_sales
0  Central               6         1199
1     East               3          691
2     West               2          231

In [256]:
df['Manager'].unique()

array(['Martha', 'Hermann', 'Timothy', 'Douglas'], dtype=object)

In [22]:
a=df.groupby('Manager')['Units'].sum().reset_index()

In [23]:
a

   Manager  Units
0  Douglas    415
1  Hermann    647
2   Martha    704
3  Timothy    355

In [27]:
b=df.groupby('Manager')['Sale_amt'].sum().reset_index()

In [28]:
b

   Manager  Sale_amt
0  Douglas  239056.0
1  Hermann  365108.5
2   Martha  472493.0
3  Timothy  229018.0

In [29]:
total=a['Units'].sum()

In [30]:
total

2121

In [31]:
total_1=b['Sale_amt'].sum()

In [32]:
total_1

1305675.5

In [33]:
a['unit_avg']=(a['Units']/total)*100

In [34]:
a

   Manager  Units        avg
0  Douglas    415  19.566242
1  Hermann    647  30.504479
2   Martha    704  33.191891
3  Timothy    355  16.737388

In [35]:
a['avg'].sum()

99.99999999999999

In [36]:
a['sales_avg']=(b['Sale_amt']/total_1)*100

In [37]:
a

   Manager  Units        avg  sales_avg
0  Douglas    415  19.566242  18.308990
1  Hermann    647  30.504479  27.963188
2   Martha    704  33.191891  36.187629
3  Timothy    355  16.737388  17.540193

In [38]:
a['sales_avg'].sum()

100.0

In [39]:
b['percent_sales ']=(b['Sale_amt']/total_1)*100

In [40]:
b

   Manager  Sale_amt  percent_sales
0  Douglas  239056.0       18.308990
1  Hermann  365108.5       27.963188
2   Martha  472493.0       36.187629
3  Timothy  229018.0       17.540193

In [48]:
b=b.drop(['Sale_amt'],axis=1)

In [49]:
b

   Manager  percent_sales
0  Douglas       18.308990
1  Hermann       27.963188
2   Martha       36.187629
3  Timothy       17.540193

In [53]:
df_1=pd.read_csv('imdb.csv')

ParserError: Error tokenizing data. C error: Expected 44 fields in line 66, saw 46

In [246]:
df_1 = pd.read_csv('imdb.csv', error_bad_lines=False)

b'Skipping line 66: expected 44 fields, saw 46\nSkipping line 111: expected 44 fields, saw 45\nSkipping line 198: expected 44 fields, saw 45\nSkipping line 222: expected 44 fields, saw 46\nSkipping line 278: expected 44 fields, saw 45\nSkipping line 396: expected 44 fields, saw 45\nSkipping line 403: expected 44 fields, saw 45\nSkipping line 421: expected 44 fields, saw 45\nSkipping line 437: expected 44 fields, saw 45\nSkipping line 462: expected 44 fields, saw 46\nSkipping line 491: expected 44 fields, saw 45\nSkipping line 515: expected 44 fields, saw 45\nSkipping line 529: expected 44 fields, saw 45\nSkipping line 530: expected 44 fields, saw 45\nSkipping line 558: expected 44 fields, saw 45\nSkipping line 623: expected 44 fields, saw 45\nSkipping line 646: expected 44 fields, saw 45\nSkipping line 663: expected 44 fields, saw 46\nSkipping line 713: expected 44 fields, saw 45\nSkipping line 730: expected 44 fields, saw 47\nSkipping line 791: expected 44 fields, saw 45\nSkipping line 813: expected 44 fields, saw 45\nSkipping line 837: expected 44 fields, saw 45\nSkipping line 861: expected 44 fields, saw 45\nSkipping line 874: expected 44 fields, saw 45\nSkipping line 899: expected 44 fields, saw 45\nSkipping line 917: expected 44 fields, saw 45\nSkipping line 944: expected 44 fields, saw 46\nSkipping line 994: expected 44 fields, saw 45\nSkipping line 1027: expected 44 fields, saw 45\nSkipping line 1046: expected 44 fields, saw 45\nSkipping line 1097: expected 44 fields, saw 45\nSkipping line 1106: expected 44 fields, saw 45\nSkipping line 1170: expected 44 fields, saw 45\nSkipping line 1194: expected 44 fields, saw 45\nSkipping line 1195: expected 44 fields, saw 45\nSkipping line 1218: expected 44 fields, saw 45\nSkipping line 1220: expected 44 fields, saw 45\nSkipping line 1270: expected 44 fields, saw 45\nSkipping line 1338: expected 44 fields, saw 47\nSkipping line 1355: expected 44 fields, saw 45\nSkipping line 1363: expected 44 fields, saw 45\nSkipping line 1395: expected 44 fields, saw 45\nSkipping line 1402: expected 44 fields, saw 46\nSkipping line 1418: expected 44 fields, saw 45\nSkipping line 1431: expected 44 fields, saw 45\nSkipping line 1617: expected 44 fields, saw 45\nSkipping line 1663: expected 44 fields, saw 45\nSkipping line 1742: expected 44 fields, saw 46\nSkipping line 1766: expected 44 fields, saw 45\nSkipping line 1799: expected 44 fields, saw 45\nSkipping line 1867: expected 44 fields, saw 45\nSkipping line 1899: expected 44 fields, saw 45\nSkipping line 1900: expected 44 fields, saw 45\nSkipping line 1901: expected 44 fields, saw 45\nSkipping line 1907: expected 44 fields, saw 45\nSkipping line 1913: expected 44 fields, saw 45\nSkipping line 1924: expected 44 fields, saw 45\nSkipping line 1939: expected 44 fields, saw 45\nSkipping line 1945: expected 44 fields, saw 45\nSkipping line 1982: expected 44 fields, saw 45\nSkipping line 2023: expected 44 fields, saw 45\nSkipping line 2028: expected 44 fields, saw 45\nSkipping line 2054: expected 44 fields, saw 45\nSkipping line 2076: expected 44 fields, saw 45\nSkipping line 2081: expected 44 fields, saw 45\nSkipping line 2092: expected 44 fields, saw 45\nSkipping line 2107: expected 44 fields, saw 45\nSkipping line 2160: expected 44 fields, saw 45\nSkipping line 2260: expected 44 fields, saw 45\nSkipping line 2261: expected 44 fields, saw 45\nSkipping line 2289: expected 44 fields, saw 46\nSkipping line 2290: expected 44 fields, saw 45\nSkipping line 2349: expected 44 fields, saw 45\nSkipping line 2395: expected 44 fields, saw 45\nSkipping line 2507: expected 44 fields, saw 45\nSkipping line 2584: expected 44 fields, saw 45\nSkipping line 2588: expected 44 fields, saw 46\nSkipping line 2595: expected 44 fields, saw 45\nSkipping line 2604: expected 44 fields, saw 45\nSkipping line 2622: expected 44 fields, saw 45\nSkipping line 2661: expected 44 fields, saw 45\nSkipping line 2714: expected 44 fields, saw 45\nSkipping line 2722: expected 44 fields, saw 45\nSkipping line 2776: expected 44 fields, saw 45\nSkipping line 2806: expected 44 fields, saw 45\nSkipping line 2826: expected 44 fields, saw 45\nSkipping line 2882: expected 44 fields, saw 45\nSkipping line 2909: expected 44 fields, saw 45\nSkipping line 3005: expected 44 fields, saw 45\nSkipping line 3019: expected 44 fields, saw 45\nSkipping line 3052: expected 44 fields, saw 45\nSkipping line 3062: expected 44 fields, saw 45\nSkipping line 3086: expected 44 fields, saw 45\nSkipping line 3089: expected 44 fields, saw 45\nSkipping line 3134: expected 44 fields, saw 46\nSkipping line 3157: expected 44 fields, saw 45\nSkipping line 3163: expected 44 fields, saw 45\nSkipping line 3177: expected 44 fields, saw 45\nSkipping line 3190: expected 44 fields, saw 45\nSkipping line 3205: expected 44 fields, saw 45\nSkipping line 3209: expected 44 fields, saw 45\nSkipping line 3238: expected 44 fields, saw 45\nSkipping line 3242: expected 44 fields, saw 45\nSkipping line 3255: expected 44 fields, saw 45\nSkipping line 3303: expected 44 fields, saw 45\nSkipping line 3314: expected 44 fields, saw 45\nSkipping line 3322: expected 44 fields, saw 45\nSkipping line 3358: expected 44 fields, saw 45\nSkipping line 3360: expected 44 fields, saw 46\nSkipping line 3377: expected 44 fields, saw 45\nSkipping line 3413: expected 44 fields, saw 45\nSkipping line 3481: expected 44 fields, saw 45\nSkipping line 3496: expected 44 fields, saw 45\nSkipping line 3719: expected 44 fields, saw 45\nSkipping line 3792: expected 44 fields, saw 45\nSkipping line 3807: expected 44 fields, saw 46\nSkipping line 3858: expected 44 fields, saw 45\nSkipping line 3864: expected 44 fields, saw 45\nSkipping line 3902: expected 44 fields, saw 45\nSkipping line 3943: expected 44 fields, saw 45\nSkipping line 3969: expected 44 fields, saw 45\nSkipping line 4024: expected 44 fields, saw 47\nSkipping line 4044: expected 44 fields, saw 45\nSkipping line 4045: expected 44 fields, saw 45\nSkipping line 4112: expected 44 fields, saw 45\nSkipping line 4149: expected 44 fields, saw 45\nSkipping line 4280: expected 44 fields, saw 45\nSkipping line 4282: expected 44 fields, saw 45\nSkipping line 4308: expected 44 fields, saw 45\nSkipping line 4377: expected 44 fields, saw 45\nSkipping line 4390: expected 44 fields, saw 45\nSkipping line 4404: expected 44 fields, saw 45\nSkipping line 4416: expected 44 fields, saw 45\nSkipping line 4423: expected 44 fields, saw 46\nSkipping line 4540: expected 44 fields, saw 45\nSkipping line 4554: expected 44 fields, saw 45\nSkipping line 4556: expected 44 fields, saw 46\nSkipping line 4572: expected 44 fields, saw 45\nSkipping line 4593: expected 44 fields, saw 45\nSkipping line 4614: expected 44 fields, saw 45\nSkipping line 4688: expected 44 fields, saw 45\nSkipping line 4750: expected 44 fields, saw 45\nSkipping line 4764: expected 44 fields, saw 45\nSkipping line 4765: expected 44 fields, saw 45\nSkipping line 4849: expected 44 fields, saw 45\nSkipping line 4865: expected 44 fields, saw 45\nSkipping line 4892: expected 44 fields, saw 45\nSkipping line 4893: expected 44 fields, saw 45\nSkipping line 4897: expected 44 fields, saw 45\nSkipping line 4923: expected 44 fields, saw 45\nSkipping line 4956: expected 44 fields, saw 45\nSkipping line 4957: expected 44 fields, saw 45\nSkipping line 4962: expected 44 fields, saw 45\nSkipping line 4967: expected 44 fields, saw 45\nSkipping line 4971: expected 44 fields, saw 45\nSkipping line 5057: expected 44 fields, saw 45\nSkipping line 5061: expected 44 fields, saw 45\nSkipping line 5097: expected 44 fields, saw 45\nSkipping line 5125: expected 44 fields, saw 45\nSkipping line 5180: expected 44 fields, saw 45\nSkipping line 5207: expected 44 fields, saw 45\nSkipping line 5339: expected 44 fields, saw 45\nSkipping line 5426: expected 44 fields, saw 45\nSkipping line 5474: expected 44 fields, saw 45\nSkipping line 5511: expected 44 fields, saw 45\nSkipping line 5561: expected 44 fields, saw 45\nSkipping line 5563: expected 44 fields, saw 45\nSkipping line 5689: expected 44 fields, saw 45\nSkipping line 5725: expected 44 fields, saw 45\nSkipping line 5759: expected 44 fields, saw 45\nSkipping line 5796: expected 44 fields, saw 45\nSkipping line 5829: expected 44 fields, saw 45\nSkipping line 5854: expected 44 fields, saw 45\nSkipping line 5886: expected 44 fields, saw 45\nSkipping line 5899: expected 44 fields, saw 45\nSkipping line 5901: expected 44 fields, saw 45\nSkipping line 5970: expected 44 fields, saw 45\nSkipping line 5996: expected 44 fields, saw 45\nSkipping line 6085: expected 44 fields, saw 45\nSkipping line 6087: expected 44 fields, saw 45\nSkipping line 6095: expected 44 fields, saw 45\nSkipping line 6096: expected 44 fields, saw 45\nSkipping line 6098: expected 44 fields, saw 45\nSkipping line 6115: expected 44 fields, saw 46\nSkipping line 6158: expected 44 fields, saw 46\nSkipping line 6174: expected 44 fields, saw 45\nSkipping line 6187: expected 44 fields, saw 45\nSkipping line 6218: expected 44 fields, saw 45\nSkipping line 6266: expected 44 fields, saw 45\nSkipping line 6275: expected 44 fields, saw 45\nSkipping line 6279: expected 44 fields, saw 45\nSkipping line 6296: expected 44 fields, saw 45\nSkipping line 6471: expected 44 fields, saw 46\nSkipping line 6494: expected 44 fields, saw 45\nSkipping line 6497: expected 44 fields, saw 45\nSkipping line 6614: expected 44 fields, saw 46\nSkipping line 6714: expected 44 fields, saw 45\nSkipping line 6727: expected 44 fields, saw 45\nSkipping line 6752: expected 44 fields, saw 45\nSkipping line 6763: expected 44 fields, saw 45\nSkipping line 6817: expected 44 fields, saw 45\nSkipping line 6853: expected 44 fields, saw 45\nSkipping line 6904: expected 44 fields, saw 45\nSkipping line 6914: expected 44 fields, saw 45\nSkipping line 6948: expected 44 fields, saw 45\nSkipping line 6969: expected 44 fields, saw 45\nSkipping line 6979: expected 44 fields, saw 45\nSkipping line 7010: expected 44 fields, saw 47\nSkipping line 7024: expected 44 fields, saw 45\nSkipping line 7036: expected 44 fields, saw 45\nSkipping line 7069: expected 44 fields, saw 45\nSkipping line 7146: expected 44 fields, saw 45\nSkipping line 7168: expected 44 fields, saw 45\nSkipping line 7170: expected 44 fields, saw 45\nSkipping line 7317: expected 44 fields, saw 45\nSkipping line 7399: expected 44 fields, saw 45\nSkipping line 7402: expected 44 fields, saw 45\nSkipping line 7496: expected 44 fields, saw 45\nSkipping line 7584: expected 44 fields, saw 45\nSkipping line 7666: expected 44 fields, saw 45\nSkipping line 7690: expected 44 fields, saw 45\nSkipping line 7704: expected 44 fields, saw 47\nSkipping line 7738: expected 44 fields, saw 45\nSkipping line 7773: expected 44 fields, saw 45\nSkipping line 7803: expected 44 fields, saw 45\nSkipping line 7839: expected 44 fields, saw 45\nSkipping line 7850: expected 44 fields, saw 45\nSkipping line 7910: expected 44 fields, saw 45\nSkipping line 7942: expected 44 fields, saw 45\nSkipping line 7959: expected 44 fields, saw 45\nSkipping line 8024: expected 44 fields, saw 45\nSkipping line 8026: expected 44 fields, saw 45\nSkipping line 8028: expected 44 fields, saw 45\nSkipping line 8033: expected 44 fields, saw 45\nSkipping line 8052: expected 44 fields, saw 45\nSkipping line 8129: expected 44 fields, saw 45\nSkipping line 8138: expected 44 fields, saw 45\nSkipping line 8160: expected 44 fields, saw 46\nSkipping line 8244: expected 44 fields, saw 45\nSkipping line 8255: expected 44 fields, saw 45\nSkipping line 8390: expected 44 fields, saw 45\nSkipping line 8400: expected 44 fields, saw 45\nSkipping line 8429: expected 44 fields, saw 45\nSkipping line 8446: expected 44 fields, saw 46\nSkipping line 8565: expected 44 fields, saw 46\nSkipping line 8622: expected 44 fields, saw 46\nSkipping line 8658: expected 44 fields, saw 45\nSkipping line 8742: expected 44 fields, saw 45\nSkipping line 8748: expected 44 fields, saw 45\nSkipping line 8802: expected 44 fields, saw 45\nSkipping line 8844: expected 44 fields, saw 45\nSkipping line 8874: expected 44 fields, saw 45\nSkipping line 8882: expected 44 fields, saw 45\nSkipping line 8885: expected 44 fields, saw 48\nSkipping line 8910: expected 44 fields, saw 45\nSkipping line 8923: expected 44 fields, saw 45\nSkipping line 8947: expected 44 fields, saw 45\nSkipping line 8958: expected 44 fields, saw 45\nSkipping line 9039: expected 44 fields, saw 46\nSkipping line 9090: expected 44 fields, saw 45\nSkipping line 9112: expected 44 fields, saw 45\nSkipping line 9137: expected 44 fields, saw 45\nSkipping line 9201: expected 44 fields, saw 45\nSkipping line 9257: expected 44 fields, saw 45\nSkipping line 9272: expected 44 fields, saw 45\nSkipping line 9390: expected 44 fields, saw 45\nSkipping line 9487: expected 44 fields, saw 45\nSkipping line 9518: expected 44 fields, saw 45\nSkipping line 9554: expected 44 fields, saw 45\nSkipping line 9576: expected 44 fields, saw 45\nSkipping line 9671: expected 44 fields, saw 45\nSkipping line 9690: expected 44 fields, saw 45\nSkipping line 9758: expected 44 fields, saw 45\nSkipping line 9759: expected 44 fields, saw 45\nSkipping line 9767: expected 44 fields, saw 45\nSkipping line 9776: expected 44 fields, saw 45\nSkipping line 9805: expected 44 fields, saw 45\nSkipping line 9834: expected 44 fields, saw 45\nSkipping line 9837: expected 44 fields, saw 45\nSkipping line 9854: expected 44 fields, saw 45\nSkipping line 9890: expected 44 fields, saw 45\nSkipping line 9897: expected 44 fields, saw 45\nSkipping line 9957: expected 44 fields, saw 45\nSkipping line 9979: expected 44 fields, saw 45\nSkipping line 9980: expected 44 fields, saw 45\nSkipping line 10001: expected 44 fields, saw 45\nSkipping line 10002: expected 44 fields, saw 45\nSkipping line 10023: expected 44 fields, saw 45\nSkipping line 10032: expected 44 fields, saw 45\nSkipping line 10051: expected 44 fields, saw 45\nSkipping line 10059: expected 44 fields, saw 46\nSkipping line 10086: expected 44 fields, saw 45\nSkipping line 10102: expected 44 fields, saw 45\nSkipping line 10118: expected 44 fields, saw 45\nSkipping line 10184: expected 44 fields, saw 45\nSkipping line 10199: expected 44 fields, saw 45\nSkipping line 10204: expected 44 fields, saw 45\nSkipping line 10218: expected 44 fields, saw 45\nSkipping line 10224: expected 44 fields, saw 45\nSkipping line 10294: expected 44 fields, saw 45\nSkipping line 10296: expected 44 fields, saw 45\nSkipping line 10331: expected 44 fields, saw 45\nSkipping line 10342: expected 44 fields, saw 45\nSkipping line 10351: expected 44 fields, saw 45\nSkipping line 10414: expected 44 fields, saw 45\nSkipping line 10430: expected 44 fields, saw 45\nSkipping line 10463: expected 44 fields, saw 45\nSkipping line 10478: expected 44 fields, saw 46\nSkipping line 10533: expected 44 fields, saw 45\nSkipping line 10536: expected 44 fields, saw 45\nSkipping line 10539: expected 44 fields, saw 45\nSkipping line 10549: expected 44 fields, saw 45\nSkipping line 10582: expected 44 fields, saw 45\nSkipping line 10588: expected 44 fields, saw 45\nSkipping line 10598: expected 44 fields, saw 45\nSkipping line 10660: expected 44 fields, saw 45\nSkipping line 10733: expected 44 fields, saw 45\nSkipping line 10806: expected 44 fields, saw 45\nSkipping line 10862: expected 44 fields, saw 45\nSkipping line 10905: expected 44 fields, saw 45\nSkipping line 10993: expected 44 fields, saw 45\nSkipping line 11070: expected 44 fields, saw 45\nSkipping line 11084: expected 44 fields, saw 45\nSkipping line 11110: expected 44 fields, saw 45\nSkipping line 11123: expected 44 fields, saw 45\nSkipping line 11128: expected 44 fields, saw 45\nSkipping line 11129: expected 44 fields, saw 45\nSkipping line 11196: expected 44 fields, saw 45\nSkipping line 11210: expected 44 fields, saw 45\nSkipping line 11254: expected 44 fields, saw 45\nSkipping line 11290: expected 44 fields, saw 45\nSkipping line 11365: expected 44 fields, saw 45\nSkipping line 11433: expected 44 fields, saw 45\nSkipping line 11434: expected 44 fields, saw 45\nSkipping line 11469: expected 44 fields, saw 45\nSkipping line 11475: expected 44 fields, saw 45\nSkipping line 11480: expected 44 fields, saw 45\nSkipping line 11513: expected 44 fields, saw 45\nSkipping line 11522: expected 44 fields, saw 45\nSkipping line 11553: expected 44 fields, saw 45\nSkipping line 11610: expected 44 fields, saw 45\nSkipping line 11641: expected 44 fields, saw 45\nSkipping line 11655: expected 44 fields, saw 46\nSkipping line 11689: expected 44 fields, saw 45\nSkipping line 11753: expected 44 fields, saw 45\nSkipping line 11776: expected 44 fields, saw 45\nSkipping line 11797: expected 44 fields, saw 45\nSkipping line 11809: expected 44 fields, saw 45\nSkipping line 11882: expected 44 fields, saw 45\nSkipping line 11915: expected 44 fields, saw 45\nSkipping line 11917: expected 44 fields, saw 46\nSkipping line 11929: expected 44 fields, saw 45\nSkipping line 11956: expected 44 fields, saw 45\nSkipping line 12031: expected 44 fields, saw 45\nSkipping line 12047: expected 44 fields, saw 46\nSkipping line 12160: expected 44 fields, saw 45\nSkipping line 12180: expected 44 fields, saw 45\nSkipping line 12184: expected 44 fields, saw 45\nSkipping line 12224: expected 44 fields, saw 45\nSkipping line 12227: expected 44 fields, saw 45\nSkipping line 12233: expected 44 fields, saw 45\nSkipping line 12251: expected 44 fields, saw 45\nSkipping line 12256: expected 44 fields, saw 45\nSkipping line 12257: expected 44 fields, saw 45\nSkipping line 12259: expected 44 fields, saw 45\nSkipping line 12355: expected 44 fields, saw 45\nSkipping line 12378: expected 44 fields, saw 45\nSkipping line 12398: expected 44 fields, saw 45\nSkipping line 12486: expected 44 fields, saw 45\nSkipping line 12516: expected 44 fields, saw 45\nSkipping line 12588: expected 44 fields, saw 45\nSkipping line 12595: expected 44 fields, saw 45\nSkipping line 12614: expected 44 fields, saw 45\nSkipping line 12642: expected 44 fields, saw 45\nSkipping line 12701: expected 44 fields, saw 45\nSkipping line 12741: expected 44 fields, saw 46\nSkipping line 12771: expected 44 fields, saw 45\nSkipping line 12777: expected 44 fields, saw 45\nSkipping line 12802: expected 44 fields, saw 45\nSkipping line 12892: expected 44 fields, saw 45\nSkipping line 12910: expected 44 fields, saw 47\nSkipping line 12982: expected 44 fields, saw 46\nSkipping line 13024: expected 44 fields, saw 45\nSkipping line 13052: expected 44 fields, saw 45\nSkipping line 13056: expected 44 fields, saw 45\nSkipping line 13158: expected 44 fields, saw 45\nSkipping line 13170: expected 44 fields, saw 45\nSkipping line 13171: expected 44 fields, saw 45\nSkipping line 13186: expected 44 fields, saw 45\nSkipping line 13240: expected 44 fields, saw 45\nSkipping line 13262: expected 44 fields, saw 45\nSkipping line 13374: expected 44 fields, saw 45\nSkipping line 13407: expected 44 fields, saw 45\nSkipping line 13477: expected 44 fields, saw 45\nSkipping line 13540: expected 44 fields, saw 46\nSkipping line 13569: expected 44 fields, saw 45\nSkipping line 13617: expected 44 fields, saw 46\nSkipping line 13651: expected 44 fields, saw 45\nSkipping line 13663: expected 44 fields, saw 45\nSkipping line 13754: expected 44 fields, saw 46\nSkipping line 13775: expected 44 fields, saw 45\nSkipping line 13804: expected 44 fields, saw 45\nSkipping line 13828: expected 44 fields, saw 45\nSkipping line 13865: expected 44 fields, saw 46\nSkipping line 13883: expected 44 fields, saw 45\nSkipping line 13929: expected 44 fields, saw 45\nSkipping line 13948: expected 44 fields, saw 45\nSkipping line 14022: expected 44 fields, saw 45\nSkipping line 14127: expected 44 fields, saw 45\nSkipping line 14148: expected 44 fields, saw 45\nSkipping line 14173: expected 44 fields, saw 45\nSkipping line 14243: expected 44 fields, saw 45\nSkipping line 14254: expected 44 fields, saw 45\nSkipping line 14318: expecte

In [56]:
df_1.describe()

,imdbRating,ratingCount,duration,year,nrOfWins,nrOfNominations,nrOfPhotos,nrOfNewsArticles,nrOfUserReviews,nrOfGenre,...,News,RealityTV,Romance,SciFi,Short,Sport,TalkShow,Thriller,War,Western
count,13153.000000,1.315300e+04,13331.000000,14305.000000,14332.000000,14332.000000,14332.000000,14332.000000,14332.000000,14332.000000,...,14332.000000,14332.000000,14332.000000,14332.000000,14332.000000,14332.000000,14332.000000,14332.000000,14332.000000,14332.000000
mean,6.864198,2.659931e+04,5424.729128,1990.786578,3.104661,4.525119,23.747977,252.545004,103.894013,2.233464,...,0.011024,0.008722,0.126012,0.067541,0.037887,0.016118,0.036282,0.090357,0.031887,0.021909
std,1.121516,6.558283e+04,2785.490153,22.198970,9.288554,16.038089,66.114012,1065.105124,231.298846,0.828999,...,0.104420,0.092985,0.331874,0.250966,0.190930,0.125933,0.186999,0.286703,0.175705,0.146392
min,1.000000,5.000000e+00,2.000000,1888.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,6.300000,6.020000e+02,3720.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,3.000000,2.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,7.000000,3.990000e+03,5700.000000,1999.000000,0.000000,0.000000,7.000000,8.000000,30.000000,2.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,7.600000,2.090500e+04,6660.000000,2008.000000,2.000000,3.000000,26.000000,103.000000,103.000000,3.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,9.900000,1.183395e+06,68400.000000,2017.000000,226.000000,542.000000,2810.000000,32345.000000,4928.000000,3.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [69]:

print(df_1.columns.unique())
print('\n')
print(df_1.columns.nunique())

Index(['fn', 'tid', 'title', 'wordsInTitle', 'url', 'imdbRating',
       'ratingCount', 'duration', 'year', 'type', 'nrOfWins',
       'nrOfNominations', 'nrOfPhotos', 'nrOfNewsArticles', 'nrOfUserReviews',
       'nrOfGenre', 'Action', 'Adult', 'Adventure', 'Animation', 'Biography',
       'Comedy', 'Crime', 'Documentary', 'Drama', 'Family', 'Fantasy',
       'FilmNoir', 'GameShow', 'History', 'Horror', 'Music', 'Musical',
       'Mystery', 'News', 'RealityTV', 'Romance', 'SciFi', 'Short', 'Sport',
       'TalkShow', 'Thriller', 'War', 'Western'],
      dtype='object')


44

In [58]:
len(df_1)

14332

In [78]:
p=df_1.iloc[4]['imdbRating' ]

In [79]:
p

8.7

In [110]:
m=df_1[df_1['duration']==df_1['duration'].max()]['title'].reset_index().iloc[0][1]

In [111]:
m

'Baseball The National Pastime (TV Episode 1994)'

In [88]:
df_1['duration'].max()

68400.0

In [112]:
n=df_1[df_1['duration']==df_1['duration'].min()]['title'].reset_index().iloc[0][1]

In [113]:
n

'Traffic Crossing Leeds Bridge (1888)'

In [114]:
df_1['duration'].min()

2.0

In [115]:
df_1[df_1['duration']==df_1['duration'].min()]['title']

13282    Traffic Crossing Leeds Bridge (1888)
Name: title, dtype: object

In [122]:
df_1['year'].nunique()

116

In [133]:
print(df_1['year'].max())
print(df_1['year'].min())

2017.0
1888.0

In [222]:
a=df_1.groupby(['year','imdbRating'])['title'].unique().reset_index()

In [212]:
b=df_1.drop(['imdbRating','year'],axis=1)

In [223]:
a.head()

     year  imdbRating                                     title
0  1888.0         7.2    [Traffic Crossing Leeds Bridge (1888)]
1  1888.0         7.8            [Roundhay Garden Scene (1888)]
2  1893.0         6.3                 [Blacksmith Scene (1893)]
3  1894.0         6.8  [Dickson Experimental Sound Film (1894)]
4  1899.0         5.9           [The Kiss in the Tunnel (1899)]

In [224]:
b.head()

,fn,tid,title,wordsInTitle,url,ratingCount,duration,type,nrOfWins,nrOfNominations,...,News,RealityTV,Romance,SciFi,Short,Sport,TalkShow,Thriller,War,Western
0,titles01/tt0012349,tt0012349,Der Vagabund und das Kind (1921),der vagabund und das kind,http://www.imdb.com/title/tt0012349/,40550.0,3240.0,video.movie,1,0,...,0,0,0,0,0,0,0,0,0,0
1,titles01/tt0015864,tt0015864,Goldrausch (1925),goldrausch,http://www.imdb.com/title/tt0015864/,45319.0,5700.0,video.movie,2,1,...,0,0,0,0,0,0,0,0,0,0
2,titles01/tt0017136,tt0017136,Metropolis (1927),metropolis,http://www.imdb.com/title/tt0017136/,81007.0,9180.0,video.movie,3,4,...,0,0,0,1,0,0,0,0,0,0
3,titles01/tt0017925,tt0017925,Der General (1926),der general,http://www.imdb.com/title/tt0017925/,37521.0,6420.0,video.movie,1,1,...,0,0,0,0,0,0,0,0,0,0
4,titles01/tt0021749,tt0021749,Lichter der Großstadt (1931),lichter der gro stadt,http://www.imdb.com/title/tt0021749/,70057.0,5220.0,video.movie,2,0,...,0,0,1,0,0,0,0,0,0,0

In [230]:
a['title']=a['title'].apply(lambda x: x[0])

In [231]:
a.head()

     year  imdbRating                                   title
0  1888.0         7.2    Traffic Crossing Leeds Bridge (1888)
1  1888.0         7.8            Roundhay Garden Scene (1888)
2  1893.0         6.3                 Blacksmith Scene (1893)
3  1894.0         6.8  Dickson Experimental Sound Film (1894)
4  1899.0         5.9           The Kiss in the Tunnel (1899)

In [232]:
new_df=pd.merge(a,b,how='inner',on='title')

In [234]:
new_df.head()

,year,imdbRating,title,fn,tid,wordsInTitle,url,ratingCount,duration,type,...,News,RealityTV,Romance,SciFi,Short,Sport,TalkShow,Thriller,War,Western
0,1888.0,7.2,Traffic Crossing Leeds Bridge (1888),titles04/index.html.8070,tt0343112,traffic crossing leeds bridge,http://www.imdb.com/title/tt0343112/,1442.0,2.0,video.movie,...,0,0,0,0,1,0,0,0,0,0
1,1888.0,7.8,Roundhay Garden Scene (1888),titles04/index.html.8647,tt0392728,roundhay garden scene,http://www.imdb.com/title/tt0392728/,2931.0,NaN,video.movie,...,0,0,0,0,1,0,0,0,0,0
2,1893.0,6.3,Blacksmith Scene (1893),titles04/index.html,tt0000005,blacksmith scene,http://www.imdb.com/title/tt0000005/,1039.0,60.0,video.movie,...,0,0,0,0,1,0,0,0,0,0
3,1894.0,6.8,Dickson Experimental Sound Film (1894),titles04/index.html.6501,tt0177707,dickson experimental sound film,http://www.imdb.com/title/tt0177707/,965.0,22.0,video.movie,...,0,0,0,0,1,0,0,0,0,0
4,1899.0,5.9,The Kiss in the Tunnel (1899),titles04/index.html.1,tt0000248,the kiss in the tunnel,http://www.imdb.com/title/tt0000248/,530.0,60.0,video.movie,...,0,0,1,0,1,0,0,0,0,0

In [237]:
len(new_df.columns)

44

In [245]:
df_1[df_1['title']=='Traffic Crossing Leeds Bridge (1888)']

,fn,tid,title,wordsInTitle,url,imdbRating,ratingCount,duration,year,type,...,News,RealityTV,Romance,SciFi,Short,Sport,TalkShow,Thriller,War,Western
13282,titles04/index.html.8070,tt0343112,Traffic Crossing Leeds Bridge (1888),traffic crossing leeds bridge,http://www.imdb.com/title/tt0343112/,7.2,1442.0,2.0,1888.0,video.movie,...,0,0,0,0,1,0,0,0,0,0

Index(['fn', 'tid', 'title', 'wordsInTitle', 'url', 'imdbRating',
       'ratingCount', 'duration', 'year', 'type', 'nrOfWins',
       'nrOfNominations', 'nrOfPhotos', 'nrOfNewsArticles', 'nrOfUserReviews',
       'nrOfGenre', 'Action', 'Adult', 'Adventure', 'Animation', 'Biography',
       'Comedy', 'Crime', 'Documentary', 'Drama', 'Family', 'Fantasy',
       'FilmNoir', 'GameShow', 'History', 'Horror', 'Music', 'Musical',
       'Mystery', 'News', 'RealityTV', 'Romance', 'SciFi', 'Short', 'Sport',
       'TalkShow', 'Thriller', 'War', 'Western'],
      dtype='object')

In [250]:
df_1.head()

,fn,tid,title,wordsInTitle,url,imdbRating,ratingCount,duration,year,type,...,News,RealityTV,Romance,SciFi,Short,Sport,TalkShow,Thriller,War,Western
0,titles01/tt0012349,tt0012349,Der Vagabund und das Kind (1921),der vagabund und das kind,http://www.imdb.com/title/tt0012349/,8.4,40550.0,3240.0,1921.0,video.movie,...,0,0,0,0,0,0,0,0,0,0
1,titles01/tt0015864,tt0015864,Goldrausch (1925),goldrausch,http://www.imdb.com/title/tt0015864/,8.3,45319.0,5700.0,1925.0,video.movie,...,0,0,0,0,0,0,0,0,0,0
2,titles01/tt0017136,tt0017136,Metropolis (1927),metropolis,http://www.imdb.com/title/tt0017136/,8.4,81007.0,9180.0,1927.0,video.movie,...,0,0,0,1,0,0,0,0,0,0
3,titles01/tt0017925,tt0017925,Der General (1926),der general,http://www.imdb.com/title/tt0017925/,8.3,37521.0,6420.0,1926.0,video.movie,...,0,0,0,0,0,0,0,0,0,0
4,titles01/tt0021749,tt0021749,Lichter der Großstadt (1931),lichter der gro stadt,http://www.imdb.com/title/tt0021749/,8.7,70057.0,5220.0,1931.0,video.movie,...,0,0,1,0,0,0,0,0,0,0

In [60]:
import numpy as np
import pandas as pd
df=pd.read_csv('diamonds.csv')

In [3]:
df.head()

  carat      cut color clarity  depth  table  price     x     y     z
0  0.23    Ideal     E     SI2   61.5   55.0  326.0  3.95  3.98  2.43
1  0.21  Premium     E     SI1   59.8   61.0  326.0  3.89  3.84  2.31
2  0.23     Good     E     VS1   56.9   65.0  327.0  4.05  4.07  2.31
3  0.29  Premium     I     VS2   62.4   58.0  334.0  4.20  4.23  2.63
4  0.31     Good     J     SI2   63.3   58.0  335.0  4.34  4.35  2.75

In [255]:
df[df.duplicated(subset=None, keep='first')==True].count()

carat      149
cut        149
color      149
clarity    149
depth      149
table      149
price      149
x          149
y          149
z          149
dtype: int64

In [260]:
len(df)-len(df.drop_duplicates())

149

In [263]:
df = df[pd.notnull(df['carat']) & pd.notnull(df['cut'])]

In [268]:
df.head()

  carat      cut color clarity  depth  table  price     x     y     z
0  0.23    Ideal     E     SI2   61.5   55.0  326.0  3.95  3.98  2.43
1  0.21  Premium     E     SI1   59.8   61.0  326.0  3.89  3.84  2.31
2  0.23     Good     E     VS1   56.9   65.0  327.0  4.05  4.07  2.31
3  0.29  Premium     I     VS2   62.4   58.0  334.0  4.20  4.23  2.63
4  0.31     Good     J     SI2   63.3   58.0  335.0  4.34  4.35  2.75

In [27]:
print(type(df['x'][0]))
print(type(df['y'][0]))
print(type(df['z'][0]))

print(type(df['carat'][0]))
print(type(df['depth'][0]))

<class 'numpy.float64'>
<class 'numpy.float64'>
<class 'str'>
<class 'str'>
<class 'numpy.float64'>

In [20]:
len(df[df['depth']>60])

48318

In [26]:
df['vol']=df['x']*df['y']*df['z']

TypeError: can't multiply sequence by non-int of type 'float'

In [25]:
if (df['depth']>60)== True:
    df['volume']=df['x']*df['y']*df['z']

0         True
1        False
2        False
3         True
4         True
5         True
6         True
7         True
8         True
9        False
10        True
11        True
12        True
13        True
14        True
15        True
16        True
17        True
18        True
19        True
20        True
21        True
22        True
23        True
24       False
25        True
26       False
27        True
28        True
29        True
         ...
53913    False
53914     True
53915     True
53916     True
53917     True
53918     True
53919     True
53920    False
53921     True
53922     True
53923     True
53924     True
53925     True
53926     True
53927     True
53928     True
53929    False
53930     True
53931     True
53932     True
53933    False
53934     True
53935     True
53936     True
53937     True
53938     True
53939     True
53940     True
53941     True
53942     True
Name: depth, Length: 53943, dtype: bool

In [31]:
df['z']=df['z'].apply(lambda x:float(x))

ValueError: could not convert string to float: 'None'

In [43]:
len(pd.notnull(df['z'])==False)
type(df['z'][0])
#float(df['z'][0])
print(df['z'][0])
print(df['z'][19])

2.43
nan

In [44]:
def nanremoval(z):
    if z==np.nan():
        z=1
        return z
    else:
        return z

In [45]:
df['z']=df['z'].apply(nanremoval)

In [46]:
df['z'][19]

nan

In [68]:
df["z"].fillna(method ='ffill', inplace = True)

In [69]:
df['z']=df['z'].apply(lambda x: float(x) )

ValueError: could not convert string to float: 'None'

In [76]:
for i,j in enumerate(df['z']):
    if df['z'][i]=='None':
        print(i)

21
432

In [77]:
df['z'][21]

'None'

In [79]:
df['z'][18]

'2.7'

In [80]:
df['x'].fillna((df['x'].mean()), inplace=True)

In [81]:
df['y'].fillna((df['y'].mean()), inplace=True)

In [82]:
df["z"].fillna(method ='ffill', inplace = True)

In [96]:
for i,j in enumerate(df['y']):
    if((type(df['y'][i])==np.float64)==False):
        print(i,j)

In [101]:
for i,j in enumerate(df['z']):
    if j=='None':
        df['z'][i]='1'

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [102]:
df['z'][21]

'1'

In [103]:
df['z']=df['z'].apply(lambda x: float(x) )

In [107]:
type(df['z'][0])

numpy.float64

In [108]:

if (df['depth']>60)== True:
    df['volume']=df['x']*df['y']*df['z']
else:
    df['volume']=8

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [111]:
df['x']*df['y']*df['z']

0         38.202030
1         34.505856
2         38.076885
3         46.724580
4         51.917250
5         38.693952
6         38.830870
7         42.321081
8         36.425214
9         38.718000
10        51.917250
11        49.658700
12        37.704420
13        34.715136
14        51.515745
15        32.262375
16        51.883728
17        50.130472
18        48.996090
19        18.019800
20        47.818022
21        18.318000
22        37.428160
23        37.601784
24        50.952974
25        48.996090
26        51.403212
27        38.366477
28        38.635246
29        49.138680
            ...
53913     94.359282
53914     99.429120
53915    126.899696
53916    132.123420
53917    124.227312
53918    118.319194
53919    143.865288
53920    121.069845
53921    126.541938
53922    109.054473
53923    111.489755
53924    112.317030
53925    120.923040
53926    122.019792
53927    130.363905
53928    115.822782
53929    131.503212
53930    132.254784
53931    116.506944
53932    115.988754
53933    112.813386
53934    114.126912
53935    115.988754
53936    113.588332
53937    116.721246
53938    115.920000
53939    118.110175
53940    114.449728
53941    140.766120
53942    124.568444
Length: 53943, dtype: float64

In [119]:
df['price'].isnull().sum()

4

In [120]:
df['price'].fillna((df['price'].mean()), inplace=True)

In [121]:
df['price'].isnull().sum()

0

In [123]:
for i,j in enumerate(df['depth']):
    
    if (df['depth'][i]>60):
        df['volume']=df['x']*df['y']*df['z']
    else:
        df['volume']=8

In [124]:
df.head()

,carat,cut,color,clarity,depth,table,price,x,y,z,volume
0,0.23,Ideal,E,SI2,61.5,55.0,326.0,3.95,3.98,2.43,38.202030
1,0.21,Premium,E,SI1,59.8,61.0,326.0,3.89,3.84,2.31,34.505856
2,0.23,Good,E,VS1,56.9,65.0,327.0,4.05,4.07,2.31,38.076885
3,0.29,Premium,I,VS2,62.4,58.0,334.0,4.20,4.23,2.63,46.724580
4,0.31,Good,J,SI2,63.3,58.0,335.0,4.34,4.35,2.75,51.917250

In [128]:
df[df['price']<60]

Empty DataFrame
Columns: [carat, cut, color, clarity, depth, table, price, x, y, z, volume]
Index: []